Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ومن خفت موازينه فأولئك الذين خسروا أنفسهم بما كانوا بآياتنا يظلمون
en: And as for those whose scale will be light, they are those who will lose their ownselves (by entering Hell) because they denied and rejected Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.).

source: ولقد مكناكم في الأرض وجعلنا لكم فيها معايش قليلا ما تشكرون
en: And surely, We gave you authority on the earth and appointed for you therein provisions (for your life). Little thanks do you give.

source: ولقد خلقناكم ثم صورناكم ثم قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس لم يكن من الساجدين
en: And surely, We created you (your father Adam) and then gave you shape (the noble shape of a human being); then We told the angels, "Prostrate yourselves to Adam", and they prostrated themselves, except Iblis (Satan), he refused to be of those who prostrated themselves.

source: قال ما منعك ألا تسجد إذ أمرتك قال أنا خير منه خلقتني من نار وخلقته من طين
en: (Allah) said: "What prevented you (O Iblis) that you did not prostrate yourself, when I commanded you?" Iblis said: "I am better than him (Adam), You created me from fire, and him You created from clay."

source: قال فاهبط منها فما يكون لك أن تتكبر فيها فاخرج إنك من الصاغرين
en: (Allah) said: "(O Iblis) get down from this (Paradise), it is not for you to be arrogant here. Get out, for you are of those humiliated and disgraced."

source: قال أنظرني إلى يوم يبعثون
en: (Iblis) said: "Allow me respite till the Day they are raised up (i.e. the Day of Resurrection)."

source: قال إنك من المنظرين
en: (Allah) said: "You are of those respited."

source: قال فبما أغويتني لأقعدن لهم صراطك المستقيم
en: (Iblis) said: "Because You have sent me astray, surely I will sit in wait against them (human beings) on Your Straight Path.

source: ثم لآتينهم من بين أيديهم ومن خلفهم وعن أيمانهم وعن شمائلهم ولا تجد أكثرهم شاكرين
en: "Then I will come to them from before them and behind them, from their right and from their left, and You will not find most of them as thankful ones (i.e. they will not be dutiful to You)."

source: قال اخرج منها مذءوما مدحورا لمن تبعك منهم لأملأن جهنم منكم أجمعين
en: (Allah) said (to Iblis): "Get out from this (Paradise), disgraced and expelled. Whoever of them (mankind) will follow you, then surely I will fill Hell with you all."

source: ويا آدم اسكن أنت وزوجك الجنة فكلا من حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين
en: "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the Zalimun (unjust and wrong-doers)."

source: فوسوس لهما الشيطان ليبدي لهما ما ووري عنهما من سوآتهما وقال ما نهاكما ربكما عن هذه الشجرة إلا أن تكونا ملكين أو تكونا من الخالدين
en: Then Shaitan (Satan) whispered suggestions to them both in order to uncover that which was hidden from them of their private parts (before); he said: "Your Lord did not forbid you this tree save that you should become angels or become of the immortals."

source: وقاسمهما إني لكما لمن الناصحين
en: And he [Shaitan (Satan)] swore by Allah to them both (saying): "Verily, I am one of the sincere well-wishers for you both."

source: فدلاهما بغرور فلما ذاقا الشجرة بدت لهما سوآتهما وطفقا يخصفان عليهما من ورق الجنة وناداهما ربهما ألم أنهكما عن تلكما الشجرة وأقل لكما إن الشيطان لكما عدو مبين
en: So he misled them with deception. Then when they tasted of the tree, that which was hidden from them of their shame (private parts) became manifest to them and they began to cover themselves with the leaves of Paradise (in order to cover their shame). And their Lord called out to them (saying): "Did I not forbid you that tree and tell you: Verily, Shaitan (Satan) is an open enemy unto you?"

source: قالا ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين
en: They said: "Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your Mercy, we shall certainly be of the losers."

source: قال اهبطوا بعضكم لبعض عدو ولكم في الأرض مستقر ومتاع إلى حين
en: (Allah) said: "Get down, one of you is an enemy to the other [i.e. Adam, Hawwa' (Eve), and Shaitan (Satan)]. On earth will be a dwelling-place for you and an enjoyment for a time."

source: قال فيها تحيون وفيها تموتون ومنها تخرجون
en: He said: "Therein you shall live, and therein you shall die, and from it you shall be brought out (i.e. resurrected)."

source: يا بني آدم قد أنزلنا عليكم لباسا يواري سوآتكم وريشا ولباس التقوى ذلك خير ذلك من آيات الله لعلهم يذكرون
en: O Children of Adam! We have bestowed raiment upon you to cover yourselves (screen your private parts) and as an adornment; and the raiment of righteousness, that is better. Such are among the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, that they may remember (i.e. leave falsehood and follow truth ).

source: يا بني آدم لا يفتننكم الشيطان كما أخرج أبويكم من الجنة ينزع عنهما لباسهما ليريهما سوآتهما إنه يراكم هو وقبيله من حيث لا ترونهم إنا جعلنا الشياطين أولياء للذين لا يؤمنون
en: O Children of Adam! Let not Shaitan (Satan) deceive you, as he got your parents [Adam and Hawwa' (Eve)] out of Paradise, stripping them of their raiments, to show them their private parts. Verily, he and Qabiluhu (his soldiers from the jinn or his tribe) see you from where you cannot see them. Verily, We made the Shayatin (devils) Auliya' (protectors and helpers) for those who believe not.

source: وإذا فعلوا فاحشة قالوا وجدنا عليها آباءنا والله أمرنا بها قل إن الله لا يأمر بالفحشاء أتقولون على الله ما لا تعلمون
en: And when they commit a Fahishah (evil deed, going round the Ka'bah in naked state, and every kind of unlawful sexual intercourse), they say: "We found our fathers doing it, and Allah has commanded it on us." Say: "Nay, Allah never commands Fahishah. Do you say of Allah what you know not?"

source: قل أمر ربي بالقسط وأقيموا وجوهكم عند كل مسجد وادعوه مخلصين له الدين كما بدأكم تعودون
en: Say (O Muhammad صلى الله عليه وسلم): My Lord has commanded justice and (said) that you should face Him only (i.e. worship none but Allah and face the Qiblah, i.e. the Ka'bah at Makkah during prayers) in every place of worship, in prayers (and not to face other false deities and idols), and invoke Him only making your religion sincere to Him (by not joining in worship any partner with Him and with the intention that you are doing your deeds for Allah's sake only). As He brought you (into being) in the beginning, so shall you be brought into being [on the Day of Resurrection in two groups, one as a blessed one (believers), and the other as a wretched one (disbelievers)].

source: فريقا هدى وفريقا حق عليهم الضلالة إنهم اتخذوا الشياطين أولياء من دون الله ويحسبون أنهم مهتدون
en: A group He has guided, and a group deserved to be in error; (because) surely they took the Shayatin (devils) as Auliya' (protectors and helpers) instead of Allah, and think that they are guided.

source: يا بني آدم خذوا زينتكم عند كل مسجد وكلوا واشربوا ولا تسرفوا إنه لا يحب المسرفين
en: O Children of Adam! Take your adornment (by wearing your clean clothes), while praying and going round (the Tawaf of) the Ka'bah, and eat and drink but waste not by extravagance, certainly He (Allah) likes not Al-Musrifun (those who waste by extravagance).

source: قل من حرم زينة الله التي أخرج لعباده والطيبات من الرزق قل هي للذين آمنوا في الحياة الدنيا خالصة يوم القيامة كذلك نفصل الآيات لقوم يعلمون
en: Say (O Muhammad صلى الله عليه وسلم): "Who has forbidden the adornment with clothes given by Allah, which He has produced for His slaves, and At-Taiyyibat [all kinds of Halal (lawful) things] of food?" Say: "They are, in the life of this world, for those who believe, (and) exclusively for them (believers) on the Day of Resurrection (the disbelievers will not share them)." Thus We explain the Ayat (Islamic laws) in detail for people who have knowledge.

source: قل إنما حرم ربي الفواحش ما ظهر منها وما بطن والإثم والبغي بغير الحق وأن تشركوا بالله ما لم ينزل به سلطانا وأن تقولوا على الله ما لا تعلمون
en: Say (O Muhammad صلى الله عليه وسلم): "(But) the things that my Lord has indeed forbidden are Al-Fawahish (great evil sins and every kind of unlawful sexual intercourse) whether committed openly or secretly, sins (of all kinds), unrighteous oppression, joining partners (in worship) with Allah for which He has given no authority, and saying things about Allah of which you have no knowledge."

source: ولكل أمة أجل فإذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون
en: And every nation has its appointed term; when their term comes, neither can they delay it nor can they advance it an hour (or a moment).

source: يا بني آدم إما يأتينكم رسل منكم يقصون عليكم آياتي فمن اتقى وأصلح فلا خوف عليهم ولا هم يحزنون
en: O Children of Adam! If there come to you Messengers from amongst you, reciting to you My Verses, then whosoever becomes pious and righteous, on them shall be no fear nor shall they grieve.

source: والذين كذبوا بآياتنا واستكبروا عنها أولئك أصحاب النار هم فيها خالدون
en: But those who reject Our Ayat (proofs, evidence, verses, lessons, signs, revelations) and treat them with arrogance, they are the dwellers of the (Hell) Fire, they will abide therein forever.

source: فمن أظلم ممن افترى على الله كذبا أو كذب بآياته أولئك ينالهم نصيبهم من الكتاب حتى إذا جاءتهم رسلنا يتوفونهم قالوا أين ما كنتم تدعون من دون الله قالوا ضلوا عنا وشهدوا على أنفسهم أنهم كانوا كافرين
en: Who is more unjust than one who invents a lie against Allah or rejects His Ayat (proofs, evidence, verses, lessons, signs, revelations)? For such their appointed portion (good things of this worldly life and their period of stay therein) will reach them from the Book (of Decrees) until when Our Messengers (the angel of death and his assistants) come to them to take their souls, they (the angels) will say: "Where are those whom you used to invoke and worship besides Allah," they will reply, "They have vanished and deserted us." And they will bear witness against themselves, that they were disbelievers.

source: قال ادخلوا في أمم قد خلت من قبلكم من الجن والإنس في النار كلما دخلت أمة لعنت أختها حتى إذا اداركوا فيها جميعا قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون
en: (Allah) will say: "Enter you in the company of nations who passed away before you, of men and jinn, into the Fire." Every time a new nation enters, it curses its sister nation (that went before) until they will be gathered all together in the Fire. The last of them will say to the first of them: "Our Lord! These misled us, so give them a double torment of the Fire." He will say: "For each one there is double (torment), but you know not."

source: وقالت أولاهم لأخراهم فما كان لكم علينا من فضل فذوقوا العذاب بما كنتم تكسبون
en: The first of them will say to the last of them: "You were not better than us, so taste the torment for what you used to earn."

source: إن الذين كذبوا بآياتنا واستكبروا عنها لا تفتح لهم أبواب السماء ولا يدخلون الجنة حتى يلج الجمل في سم الخياط وكذلك نجزي المجرمين
en: Verily, those who belie Our Ayat (proofs, evidence, verses, lessons, signs, revelations) and treat them with arrogance, for them the gates of heaven will not be opened, and they will not enter Paradise until the camel goes through the eye of the needle (which is impossible). Thus do We recompense the Mujrimun (criminals, polytheists and sinners).

source: لهم من جهنم مهاد ومن فوقهم غواش وكذلك نجزي الظالمين
en: Theirs will be a bed of Hell (Fire), and over them coverings (of Hell-fire). Thus do We recompense the Zalimun (polytheists and wrong-doers).

source: والذين آمنوا وعملوا الصالحات لا نكلف نفسا إلا وسعها أولئك أصحاب الجنة هم فيها خالدون
en: But those who believed (in the Oneness of Allah - Islamic Monotheism), and worked righteousness - We tax not any person beyond his scope - such are the dwellers of Paradise. They will abide therein.

source: ونزعنا ما في صدورهم من غل تجري من تحتهم الأنهار وقالوا الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله لقد جاءت رسل ربنا بالحق ونودوا أن تلكم الجنة أورثتموها بما كنتم تعملون
en: And We shall remove from their breasts any (mutual) hatred or sense of injury (which they had, if at all, in the life of this world); rivers flowing under them, and they will say: "All the praises and thanks be to Allah, Who has guided us to this, and never could we have found guidance, were it not that Allah had guided us! Indeed, the Messengers of our Lord did come with the truth." And it will be cried out to them: "This is the Paradise which you have inherited for what you used to do."

source: ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين
en: And the dwellers of Paradise will call out to the dwellers of the Fire (saying): "We have indeed found true what our Lord had promised us; have you also found true, what your Lord promised (warnings)?" They shall say: "Yes." Then a crier will proclaim between them: "The Curse of Allah is on the Zalimun (polytheists and wrong-doers)."

source: الذين يصدون عن سبيل الله ويبغونها عوجا وهم بالآخرة كافرون
en: Those who hindered (men) from the Path of Allah, and would seek to make it crooked, and they were disbelievers in the Hereafter.

source: وبينهما حجاب وعلى الأعراف رجال يعرفون كلا بسيماهم ونادوا أصحاب الجنة أن سلام عليكم لم يدخلوها وهم يطمعون
en: And between them will be a (barrier) screen and on Al-A'raf (a wall with elevated places) will be men (whose good and evil deeds would be equal in scale), who would recognise all (of the Paradise and Hell people), by their marks (the dwellers of Paradise by their white faces and the dwellers of Hell by their black faces), they will call out to the dwellers of Paradise, "Salamun 'Alaikum" (Peace be on you), and at that time they (men on Al-A'raf) will not yet have entered it (Paradise), but they will hope to enter (it) with certainty.

source: وإذا صرفت أبصارهم تلقاء أصحاب النار قالوا ربنا لا تجعلنا مع القوم الظالمين
en: And when their eyes will be turned towards the dwellers of the Fire, they will say: "Our Lord! Place us not with the people who are Zalimun (polytheists and wrong-doers)."

source: ونادى أصحاب الأعراف رجالا يعرفونهم بسيماهم قالوا ما أغنى عنكم جمعكم وما كنتم تستكبرون
en: And the men on Al-A'raf (the wall) will call unto the men whom they would recognise by their marks, saying: "Of what benefit to you were your great numbers (and hoards of wealth), and your arrogance (against Faith)?"

source: أهؤلاء الذين أقسمتم لا ينالهم الله برحمة ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون
en: Are they those, of whom you swore that Allah would never show them mercy. (Behold! It has been said to them): "Enter Paradise, no fear shall be on you, nor shall you grieve."

source: ونادى أصحاب النار أصحاب الجنة أن أفيضوا علينا من الماء أو مما رزقكم الله قالوا إن الله حرمهما على الكافرين
en: And the dwellers of the Fire will call to the dwellers of Paradise: "Pour on us some water or anything that Allah has provided you with." They will say: "Both (water and provision) Allah has forbidden to the disbelievers."

source: الذين اتخذوا دينهم لهوا ولعبا وغرتهم الحياة الدنيا فاليوم ننساهم كما نسوا لقاء يومهم هذا وما كانوا بآياتنا يجحدون
en: "Who took their religion as an amusement and play, and the life of the world deceived them." So this Day We shall forget them as they forgot their meeting of this Day, and as they used to reject Our Ayat (proofs, evidence, verses, lessons, signs, revelations).

source: ولقد جئناهم بكتاب فصلناه على علم هدى ورحمة لقوم يؤمنون
en: Certainly, We have brought them a Book (the Qur'an) which We have explained in detail with knowledge, - a guidance and a mercy to a people who believe.

source: هل ينظرون إلا تأويله يوم يأتي تأويله يقول الذين نسوه من قبل قد جاءت رسل ربنا بالحق فهل لنا من شفعاء فيشفعوا لنا أو نرد فنعمل غير الذي كنا نعمل قد خسروا أنفسهم وضل عنهم ما كانوا يفترون
en: Await they just for the final fullfilment of the event? On the Day the event is finally fulfilled (i.e. the Day of Resurrection), those who neglected it before will say: "Verily, the Messengers of our Lord did come with the truth, now are there any intercessors for us that they might intercede on our behalf? Or could we be sent back (to the first life of the world) so that we might do (good) deeds other than those (evil) deeds which we used to do?" Verily, they have lost their ownselves (i.e. destroyed themselves) and that which they used to fabricate (invoking and worshipping others besides Allah) has gone away from them.

source: إن ربكم الله الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يغشي الليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين
en: Indeed your Lord is Allah, Who created the heavens and the earth in Six Days, and then He rose over (Istawa) the Throne (really in a manner that suits His Majesty). He brings the night as a cover over the day, seeking it rapidly, and (He created) the sun, the moon, the stars subjected to His Command. Surely, His is the Creation and Commandment. Blessed is Allah, the Lord of the 'Alamin (mankind, jinn and all that exists)!

source: ادعوا ربكم تضرعا وخفية إنه لا يحب المعتدين
en: Invoke your Lord with humility and in secret. He likes not the aggressors.

source: ولا تفسدوا في الأرض بعد إصلاحها وادعوه خوفا وطمعا إن رحمت الله قريب من المحسنين
en: And do not do mischief on the earth, after it has been set in order, and invoke Him with fear and hope. Surely, Allah's Mercy is (ever) near unto the good-doers.

source: وهو الذي يرسل الرياح بشرا بين يدي رحمته حتى إذا أقلت سحابا ثقالا سقناه لبلد ميت فأنزلنا به الماء فأخرجنا به من كل الثمرات كذلك نخرج الموتى لعلكم تذكرون
en: And it is He Who sends the winds as heralds of glad tidings, going before His Mercy (rain). Till when they have carried a heavy-laden cloud, We drive it to a land that is dead, then We cause water (rain) to descend thereon. Then We produce every kind of fruit therewith. Similarly, We shall raise up the dead, so that you may remember or take heed.

source: والبلد الطيب يخرج نباته بإذن ربه والذي خبث لا يخرج إلا نكدا كذلك نصرف الآيات لقوم يشكرون
en: The vegetation of a good land comes forth (easily) by the Permission of its Lord; and that which is bad, brings forth nothing but (a little) with difficulty. Thus do We explain variously the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) for a people who give thanks.

source: لقد أرسلنا نوحا إلى قومه فقال يا قوم اعبدوا الله ما لكم من إله غيره إني أخاف عليكم عذاب يوم عظيم
en: Indeed, We sent Nuh (Noah) to his people and he said: "O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha illallah: none has the right to be worshipped but Allah). Certainly, I fear for you the torment of a Great Day!"

source: قال الملأ من قومه إنا لنراك في ضلال مبين
en: The leaders of his people said: "Verily, we see you in plain error."

source: قال يا قوم ليس بي ضلالة ولكني رسول من رب العالمين
en: [Nuh (Noah)] said: "O my people! There is no error in me, but I am a Messenger from the Lord of the 'Alamin (mankind, jinn and all that exists)!

source: أبلغكم رسالات ربي وأنصح لكم وأعلم من الله ما لا تعلمون
en: "I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allah what you know not.

source: أوعجبتم أن جاءكم ذكر من ربكم على رجل منكم لينذركم ولتتقوا ولعلكم ترحمون
en: "Do you wonder that there has come to you a Reminder from your Lord through a man from amongst you, that he may warn you, so that you may fear Allah and that you may receive (His) Mercy?"

source: فكذبوه فأنجيناه والذين معه في الفلك وأغرقنا الذين كذبوا بآياتنا إنهم كانوا قوما عمين
en: But they belied him, so We saved him and those along with him in the ship, and We drowned those who belied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.). They were indeed a blind people.

source: وإلى عاد أخاهم هودا قال يا قوم اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And to 'Ad (people, We sent) their brother Hud. He said: "O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha illallah: none has the right to be worshipped but Allah). Will you not fear (Allah)?"

source: قال الملأ الذين كفروا من قومه إنا لنراك في سفاهة وإنا لنظنك من الكاذبين
en: The leaders of those who disbelieved among his people said: "Verily, we see you in foolishness, and verily, we think you are one of the liars."

source: قال يا قوم ليس بي سفاهة ولكني رسول من رب العالمين
en: (Hud) said: "O my people! There is no foolishness in me, but (I am) a Messenger from the Lord of the 'Alamin (mankind, jinn and all that exists)!

source: أبلغكم رسالات ربي وأنا لكم ناصح أمين
en: "I convey unto you the Messages of my Lord, and I am a trustworthy adviser (or well-wisher) for you.

source: أوعجبتم أن جاءكم ذكر من ربكم على رجل منكم لينذركم واذكروا إذ جعلكم خلفاء من بعد قوم نوح وزادكم في الخلق بسطة فاذكروا آلاء الله لعلكم تفلحون
en: "Do you wonder that there has come to you a Reminder (and an advice) from your Lord through a man from amongst you to warn you? And remember that He made you successors after the people of Nuh (Noah) and increased you amply in stature. So remember the graces (bestowed upon you) from Allah so that you may be successful."

source: قالوا أجئتنا لنعبد الله وحده ونذر ما كان يعبد آباؤنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said: "You have come to us that we should worship Allah Alone and forsake that which our fathers used to worship. So bring us that wherewith you have threatened us if you are of the truthful."

source: قال قد وقع عليكم من ربكم رجس وغضب أتجادلونني في أسماء سميتموها أنتم وآباؤكم ما نزل الله بها من سلطان فانتظروا إني معكم من المنتظرين
en: (Hud) said: "Torment and wrath have already fallen on you from your Lord. Dispute you with me over names which you have named - you and your fathers - with no authority from Allah? Then wait, I am with you among those who wait."

source: فأنجيناه والذين معه برحمة منا وقطعنا دابر الذين كذبوا بآياتنا وما كانوا مؤمنين
en: So We saved him and those who were with him by a mercy from Us, and We cut the roots of those who belied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.); and they were not believers.

source: وإلى ثمود أخاهم صالحا قال يا قوم اعبدوا الله ما لكم من إله غيره قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية فذروها تأكل في أرض الله ولا تمسوها بسوء فيأخذكم عذاب أليم
en: And to Thamud (people, We sent) their brother Salih. He said: "O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha illallah: none has the right to be worshipped but Allah). Indeed there has come to you a clear sign (the miracle of the coming out of a huge she-camel from the midst of a rock) from your Lord. This she-camel of Allah is a sign unto you; so you leave her to graze in Allah's earth, and touch her not with harm, lest a painful torment should seize you.

source: واذكروا إذ جعلكم خلفاء من بعد عاد وبوأكم في الأرض تتخذون من سهولها قصورا وتنحتون الجبال بيوتا فاذكروا آلاء الله ولا تعثوا في الأرض مفسدين
en: And remember when He made you successors after 'Ad (people) and gave you habitations in the land, you build for yourselves palaces in plains, and carve out homes in the mountains. So remember the graces (bestowed upon you) from Allah, and do not go about making mischief on the earth."

source: قال الملأ الذين استكبروا من قومه للذين استضعفوا لمن آمن منهم أتعلمون أن صالحا مرسل من ربه قالوا إنا بما أرسل به مؤمنون
en: The leaders of those who were arrogant among his people said to those who were counted weak - to such of them as believed: "Know you that Salih is one sent from his Lord." They said: "We indeed believe in that with which he has been sent."

source: قال الذين استكبروا إنا بالذي آمنتم به كافرون
en: Those who were arrogant said: "Verily, we disbelieve in that which you believe in."
